espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_ioc.h
// Configuration of DIO37
#define IOC_O_IOCFG37                                               0x00000094

// Configuration of DIO38
#define IOC_O_IOCFG38                                               0x00000098

// Configuration of DIO39
#define IOC_O_IOCFG39                                               0x0000009C

// Configuration of DIO40
#define IOC_O_IOCFG40                                               0x000000A0

// Configuration of DIO41
#define IOC_O_IOCFG41                                               0x000000A4

// Configuration of DIO42
#define IOC_O_IOCFG42                                               0x000000A8

// Configuration of DIO43
#define IOC_O_IOCFG43                                               0x000000AC

// Configuration of DIO44
#define IOC_O_IOCFG44                                               0x000000B0

// Configuration of DIO45
#define IOC_O_IOCFG45                                               0x000000B4

// Configuration of DIO46
#define IOC_O_IOCFG46                                               0x000000B8

// Configuration of DIO47
#define IOC_O_IOCFG47                                               0x000000BC

//*****************************************************************************
//
// Register: IOC_O_IOCFG0
//
//*****************************************************************************
// Field:    [31] IOEV_MCU_WU_EN
//
// Event asserted by this IO when edge detection is enabled
//
// 0: Input edge detection does not assert MCU_WU event
// 1: Input edge detection asserts MCU_WU event
#define IOC_IOCFG0_IOEV_MCU_WU_EN                                   0x80000000
#define IOC_IOCFG0_IOEV_MCU_WU_EN_BITN                                      31
#define IOC_IOCFG0_IOEV_MCU_WU_EN_M                                 0x80000000
#define IOC_IOCFG0_IOEV_MCU_WU_EN_S                                         31

// Field:    [30] HYST_EN
//
// 0: Input hysteresis disable
// 1: Input hysteresis enable
#define IOC_IOCFG0_HYST_EN                                          0x40000000
#define IOC_IOCFG0_HYST_EN_BITN                                             30
#define IOC_IOCFG0_HYST_EN_M                                        0x40000000
#define IOC_IOCFG0_HYST_EN_S                                                30

// Field:    [29] IE
//
// 0: Input disabled
// 1: Input enabled
//
// Note: If IO is configured for AUX   PORT_ID = 0x08, the enable will be
// ignored.
#define IOC_IOCFG0_IE                                               0x20000000
#define IOC_IOCFG0_IE_BITN                                                  29
#define IOC_IOCFG0_IE_M                                             0x20000000
#define IOC_IOCFG0_IE_S                                                     29

// Field: [28:27] WU_CFG
//
// If DIO is configured GPIO or non-AON peripheral signals,  PORT_ID 0x00 or
// >0x08:
//
// 00: No wake-up
// 01: No wake-up
// 10: Wakes up from shutdown if this pad is going low.
// 11: Wakes up from shutdown if this pad is going high.
//
// If IO is configured for AON peripheral signals or AUX   PORT_ID 0x01-0x08,
// this register only sets wakeup enable or not.
//
// 00, 01: Wakeup disabled
// 10, 11: Wakeup enabled
//
// Polarity is controlled from AON registers.
//
// Note:When the MSB is set, the IOC will deactivate the output enable for the
// DIO.
#define IOC_IOCFG0_WU_CFG_W                                                  2
#define IOC_IOCFG0_WU_CFG_M                                         0x18000000
#define IOC_IOCFG0_WU_CFG_S                                                 27

// Field: [26:24] IOMODE
//
// IO Mode
// Not applicable for IO configured for AON periph. signals and AUX   PORT_ID
// 0x01-0x08
// AUX has its own open_source/drain configuration.
//
// 0x2: Reserved. Undefined behavior.
// 0x3: Reserved. Undefined behavior.
// ENUMs:
// OPENSRC_INV              Open Source
//                          Inverted input/output
// OPENSRC                  Open Source
//                          Normal input / outut
// OPENDR_INV               Open Drain
//                          Inverted input / output
// OPENDR                   Open Drain,
//                          Normal input / output
// INV                      Inverted input / ouput
// NORMAL                   Normal input / output
#define IOC_IOCFG0_IOMODE_W                                                  3
#define IOC_IOCFG0_IOMODE_M                                         0x07000000
#define IOC_IOCFG0_IOMODE_S                                                 24
#define IOC_IOCFG0_IOMODE_OPENSRC_INV                               0x07000000
#define IOC_IOCFG0_IOMODE_OPENSRC                                   0x06000000
#define IOC_IOCFG0_IOMODE_OPENDR_INV                                0x05000000
#define IOC_IOCFG0_IOMODE_OPENDR                                    0x04000000
#define IOC_IOCFG0_IOMODE_INV                                       0x01000000
#define IOC_IOCFG0_IOMODE_NORMAL                                    0x00000000

// Field:    [23] IOEV_AON_PROG2_EN
//
// Event asserted by this IO when edge detection is enabled
//
// 0: Input edge detection does not assert AON_PROG2 event
// 1: Input edge detection asserts AON_PROG2 event
#define IOC_IOCFG0_IOEV_AON_PROG2_EN                                0x00800000
#define IOC_IOCFG0_IOEV_AON_PROG2_EN_BITN                                   23
#define IOC_IOCFG0_IOEV_AON_PROG2_EN_M                              0x00800000
#define IOC_IOCFG0_IOEV_AON_PROG2_EN_S                                      23

// Field:    [22] IOEV_AON_PROG1_EN
//
// Event asserted by this IO when edge detection is enabled
//
// 0: Input edge detection does not assert AON_PROG1 event
// 1: Input edge detection asserts AON_PROG1 event
#define IOC_IOCFG0_IOEV_AON_PROG1_EN                                0x00400000
#define IOC_IOCFG0_IOEV_AON_PROG1_EN_BITN                                   22
#define IOC_IOCFG0_IOEV_AON_PROG1_EN_M                              0x00400000
#define IOC_IOCFG0_IOEV_AON_PROG1_EN_S                                      22

// Field:    [21] IOEV_AON_PROG0_EN
//
// Event asserted by this IO when edge detection is enabled
//
// 0: Input edge detection does not assert AON_PROG0 event
// 1: Input edge detection asserts AON_PROG0 event
#define IOC_IOCFG0_IOEV_AON_PROG0_EN                                0x00200000
#define IOC_IOCFG0_IOEV_AON_PROG0_EN_BITN                                   21
#define IOC_IOCFG0_IOEV_AON_PROG0_EN_M                              0x00200000
#define IOC_IOCFG0_IOEV_AON_PROG0_EN_S                                      21

