espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_ioc.h
// Field: [28:27] WU_CFG
//
// If DIO is configured GPIO or non-AON peripheral signals,  PORT_ID 0x00 or
// >0x08:
//
// 00: No wake-up
// 01: No wake-up
// 10: Wakes up from shutdown if this pad is going low.
// 11: Wakes up from shutdown if this pad is going high.
//
// If IO is configured for AON peripheral signals or AUX   PORT_ID 0x01-0x08,
// this register only sets wakeup enable or not.
//
// 00, 01: Wakeup disabled
// 10, 11: Wakeup enabled
//
// Polarity is controlled from AON registers.
//
// Note:When the MSB is set, the IOC will deactivate the output enable for the
// DIO.
#define IOC_IOCFG8_WU_CFG_W                                                  2
#define IOC_IOCFG8_WU_CFG_M                                         0x18000000
#define IOC_IOCFG8_WU_CFG_S                                                 27

// Field: [26:24] IOMODE
//
// IO Mode
// Not applicable for IO configured for AON periph. signals and AUX   PORT_ID
// 0x01-0x08
// AUX has its own open_source/drain configuration.
//
// 0x2: Reserved. Undefined behavior.
// 0x3: Reserved. Undefined behavior.
// ENUMs:
// OPENSRC_INV              Open Source
//                          Inverted input / output
// OPENSRC                  Open Source
//                          Normal input / output
// OPENDR_INV               Open Drain
//                          Inverted input / output
// OPENDR                   Open Drain,
//                          Normal input / output
// INV                      Inverted input / ouput
// NORMAL                   Normal input / output
#define IOC_IOCFG8_IOMODE_W                                                  3
#define IOC_IOCFG8_IOMODE_M                                         0x07000000
#define IOC_IOCFG8_IOMODE_S                                                 24
#define IOC_IOCFG8_IOMODE_OPENSRC_INV                               0x07000000
#define IOC_IOCFG8_IOMODE_OPENSRC                                   0x06000000
#define IOC_IOCFG8_IOMODE_OPENDR_INV                                0x05000000
#define IOC_IOCFG8_IOMODE_OPENDR                                    0x04000000
#define IOC_IOCFG8_IOMODE_INV                                       0x01000000
#define IOC_IOCFG8_IOMODE_NORMAL                                    0x00000000

// Field:    [23] IOEV_AON_PROG2_EN
//
// Event asserted by this IO when edge detection is enabled
//
// 0: Input edge detection does not assert AON_PROG2 event
// 1: Input edge detection asserts AON_PROG2 event
#define IOC_IOCFG8_IOEV_AON_PROG2_EN                                0x00800000
#define IOC_IOCFG8_IOEV_AON_PROG2_EN_BITN                                   23
#define IOC_IOCFG8_IOEV_AON_PROG2_EN_M                              0x00800000
#define IOC_IOCFG8_IOEV_AON_PROG2_EN_S                                      23

// Field:    [22] IOEV_AON_PROG1_EN
//
// Event asserted by this IO when edge detection is enabled
//
// 0: Input edge detection does not assert AON_PROG1 event
// 1: Input edge detection asserts AON_PROG1 event
#define IOC_IOCFG8_IOEV_AON_PROG1_EN                                0x00400000
#define IOC_IOCFG8_IOEV_AON_PROG1_EN_BITN                                   22
#define IOC_IOCFG8_IOEV_AON_PROG1_EN_M                              0x00400000
#define IOC_IOCFG8_IOEV_AON_PROG1_EN_S                                      22

// Field:    [21] IOEV_AON_PROG0_EN
//
// Event asserted by this IO when edge detection is enabled
//
// 0: Input edge detection does not assert AON_PROG0 event
// 1: Input edge detection asserts AON_PROG0 event
#define IOC_IOCFG8_IOEV_AON_PROG0_EN                                0x00200000
#define IOC_IOCFG8_IOEV_AON_PROG0_EN_BITN                                   21
#define IOC_IOCFG8_IOEV_AON_PROG0_EN_M                              0x00200000
#define IOC_IOCFG8_IOEV_AON_PROG0_EN_S                                      21

// Field:    [18] EDGE_IRQ_EN
//
// 0: No interrupt generation
// 1: Enable interrupt generation for this IO (Only effective if EDGE_DET is
// enabled)
#define IOC_IOCFG8_EDGE_IRQ_EN                                      0x00040000
#define IOC_IOCFG8_EDGE_IRQ_EN_BITN                                         18
#define IOC_IOCFG8_EDGE_IRQ_EN_M                                    0x00040000
#define IOC_IOCFG8_EDGE_IRQ_EN_S                                            18

// Field: [17:16] EDGE_DET
//
// Enable generation of edge detection events on this IO
// ENUMs:
// BOTH                     Positive and negative edge detection
// POS                      Positive edge detection
// NEG                      Negative edge detection
// NONE                     No edge detection
#define IOC_IOCFG8_EDGE_DET_W                                                2
#define IOC_IOCFG8_EDGE_DET_M                                       0x00030000
#define IOC_IOCFG8_EDGE_DET_S                                               16
#define IOC_IOCFG8_EDGE_DET_BOTH                                    0x00030000
#define IOC_IOCFG8_EDGE_DET_POS                                     0x00020000
#define IOC_IOCFG8_EDGE_DET_NEG                                     0x00010000
#define IOC_IOCFG8_EDGE_DET_NONE                                    0x00000000

// Field: [15:14] PULL_CTL
//
// Pull control
// ENUMs:
// DIS                      No pull
// UP                       Pull up
// DWN                      Pull down
#define IOC_IOCFG8_PULL_CTL_W                                                2
#define IOC_IOCFG8_PULL_CTL_M                                       0x0000C000
#define IOC_IOCFG8_PULL_CTL_S                                               14
#define IOC_IOCFG8_PULL_CTL_DIS                                     0x0000C000
#define IOC_IOCFG8_PULL_CTL_UP                                      0x00008000
#define IOC_IOCFG8_PULL_CTL_DWN                                     0x00004000

// Field:    [13] SLEW_RED
//
// 0: Normal slew rate
// 1: Enables reduced slew rate in output driver.
#define IOC_IOCFG8_SLEW_RED                                         0x00002000
#define IOC_IOCFG8_SLEW_RED_BITN                                            13
#define IOC_IOCFG8_SLEW_RED_M                                       0x00002000
#define IOC_IOCFG8_SLEW_RED_S                                               13

// Field: [12:11] IOCURR
//
// Selects IO current mode of this IO.
// ENUMs:
// 4_8MA                    Extended-Current (EC) mode: Min 8 mA for double
//                          drive strength IOs (min 4 mA for normal IOs)
//                          when IOSTR is set to AUTO
// 4MA                      High-Current (HC) mode: Min 4 mA when IOSTR is set
//                          to AUTO
// 2MA                      Low-Current (LC) mode: Min 2 mA when IOSTR is set
//                          to AUTO
#define IOC_IOCFG8_IOCURR_W                                                  2
#define IOC_IOCFG8_IOCURR_M                                         0x00001800
#define IOC_IOCFG8_IOCURR_S                                                 11
#define IOC_IOCFG8_IOCURR_4_8MA                                     0x00001000
#define IOC_IOCFG8_IOCURR_4MA                                       0x00000800
#define IOC_IOCFG8_IOCURR_2MA                                       0x00000000

