espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_ioc.h
// Field:  [10:9] IOSTR
//
// Select source for drive strength control of this IO.
// This setting controls the drive strength of the Low-Current (LC) mode.
// Higher drive strength can be selected in IOCURR
// ENUMs:
// MAX                      Maximum drive strength, controlled by
//                          AON_IOC:IOSTRMAX (min 2 mA @1.8V with default
//                          values)
// MED                      Medium drive strength, controlled by
//                          AON_IOC:IOSTRMED (min 2 mA @2.5V with default
//                          values)
// MIN                      Minimum drive strength, controlled by
//                          AON_IOC:IOSTRMIN (min 2 mA @3.3V with default
//                          values)
// AUTO                     Automatic drive strength, controlled by AON BATMON
//                          based on battery voltage. (min 2 mA @VDDS)
#define IOC_IOCFG44_IOSTR_W                                                  2
#define IOC_IOCFG44_IOSTR_M                                         0x00000600
#define IOC_IOCFG44_IOSTR_S                                                  9
#define IOC_IOCFG44_IOSTR_MAX                                       0x00000600
#define IOC_IOCFG44_IOSTR_MED                                       0x00000400
#define IOC_IOCFG44_IOSTR_MIN                                       0x00000200
#define IOC_IOCFG44_IOSTR_AUTO                                      0x00000000

// Field:     [8] IOEV_RTC_EN
//
// Event asserted by this IO when edge detection is enabled
//
// 0: Input edge detection does not assert RTC event
// 1: Input edge detection asserts RTC event
#define IOC_IOCFG44_IOEV_RTC_EN                                     0x00000100
#define IOC_IOCFG44_IOEV_RTC_EN_BITN                                         8
#define IOC_IOCFG44_IOEV_RTC_EN_M                                   0x00000100
#define IOC_IOCFG44_IOEV_RTC_EN_S                                            8

// Field:   [6:0] PORT_ID
//
// Selects usage for DIO44
// Note: This field should not be written other than the times when PORT_ID
// value is specifically required to change.
// ENUMs:
// I2C1_MSSCL               I2C1 Clock
// I2C1_MSSDA               I2C1 Data
// UART3_RTS                UART3 RTS
// UART3_CTS                UART3 CTS
// UART3_TX                 UART3 TX
// UART3_RX                 UART3 RX
// UART2_RTS                UART2 RTS
// UART2_CTS                UART2 CTS
// UART2_TX                 UART2 TX
// UART2_RX                 UART2 RX
// SSI3_CLK                 SSI3 CLK
// SSI3_FSS                 SSI3 FSS
// SSI3_TX                  SSI3 TX
// SSI3_RX                  SSI3 RX
// SSI2_CLK                 SSI2 CLK
// SSI2_FSS                 SSI2 FSS
// SSI2_TX                  SSI2 TX
// SSI2_RX                  SSI2 RX
// RFC_SMI_CL_IN            RF Core SMI Command Link In
// RFC_SMI_CL_OUT           RF Core SMI Command Link Out
// RFC_SMI_DL_IN            RF Core SMI Data Link In
// RFC_SMI_DL_OUT           RF Core SMI Data Link Out
// RFC_GPI1                 RF Core Data In 1
// RFC_GPI0                 RF Core Data In 0
// RFC_GPO3                 RF Core Data Out 3
// RFC_GPO2                 RF Core Data Out 2
// RFC_GPO1                 RF Core Data Out 1
// RFC_GPO0                 RF Core Data Out 0
// RFC_TRC                  RF Core Trace
// I2S_MCLK                 I2S MCLK
// I2S_BCLK                 I2S BCLK
// I2S_WCLK                 I2S WCLK
// I2S_AD1                  I2S Data 1
// I2S_AD0                  I2S Data 0
// SSI1_CLK                 SSI1 CLK
// SSI1_FSS                 SSI1 FSS
// SSI1_TX                  SSI1 TX
// SSI1_RX                  SSI1 RX
// CPU_SWV                  CPU SWV
// PORT_EVENT7              PORT EVENT 7
//                          Can be used as a general
//                          purpose IO event by selecting it through
//                          registers in the EVENT module, for example
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          and so on
// PORT_EVENT6              PORT EVENT 6
//                          Can be used as a general
//                          purpose IO event by selecting it through
//                          registers in the EVENT module, for example
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          and so on
// PORT_EVENT5              PORT EVENT 5
//                          Can be used as a general
//                          purpose IO event by selecting it through
//                          registers in the EVENT module, for example
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          and so on
// PORT_EVENT4              PORT EVENT 4
//                          Can be used as a general
//                          purpose IO event by selecting it through
//                          registers in the EVENT module, for example
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          and so on
// PORT_EVENT3              PORT EVENT 3
//                          Can be used as a general
//                          purpose IO event by selecting it through
//                          registers in the EVENT module, for example
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          and so on
// PORT_EVENT2              PORT EVENT 2
//                          Can be used as a general
//                          purpose IO event by selecting it through
//                          registers in the EVENT module, for example
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          and so on
// PORT_EVENT1              PORT EVENT 1
//                          Can be used as a general
//                          purpose IO event by selecting it through
//                          registers in the EVENT module, for example
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          and so on
// PORT_EVENT0              PORT EVENT 0
//                          Can be used as a general
//                          purpose IO event by selecting it through
//                          registers in the EVENT module, for example
//                          EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV,
//                          and so on
// UART1_RTS                UART1 RTS
// UART1_CTS                UART1 CTS
// UART1_TX                 UART1 TX
// UART1_RX                 UART1 RX
// UART0_RTS                UART0 RTS
// UART0_CTS                UART0 CTS
// UART0_TX                 UART0 TX
// UART0_RX                 UART0 RX
// I2C0_MSSCL               I2C0 Clock
// I2C0_MSSDA               I2C0 Data
// SSI0_CLK                 SSI0 CLK
// SSI0_FSS                 SSI0 FSS
// SSI0_TX                  SSI0 TX
// SSI0_RX                  SSI0 RX
// AON_CLK32K               AON 32 KHz clock (SCLK_LF)
// GPIO                     General Purpose IO
#define IOC_IOCFG44_PORT_ID_W                                                7
#define IOC_IOCFG44_PORT_ID_M                                       0x0000007F
#define IOC_IOCFG44_PORT_ID_S                                                0
#define IOC_IOCFG44_PORT_ID_I2C1_MSSCL                              0x0000004A
#define IOC_IOCFG44_PORT_ID_I2C1_MSSDA                              0x00000049
#define IOC_IOCFG44_PORT_ID_UART3_RTS                               0x00000048
#define IOC_IOCFG44_PORT_ID_UART3_CTS                               0x00000047
#define IOC_IOCFG44_PORT_ID_UART3_TX                                0x00000046
#define IOC_IOCFG44_PORT_ID_UART3_RX                                0x00000045
#define IOC_IOCFG44_PORT_ID_UART2_RTS                               0x00000044
#define IOC_IOCFG44_PORT_ID_UART2_CTS                               0x00000043
#define IOC_IOCFG44_PORT_ID_UART2_TX                                0x00000042
#define IOC_IOCFG44_PORT_ID_UART2_RX                                0x00000041
#define IOC_IOCFG44_PORT_ID_SSI3_CLK                                0x00000040
#define IOC_IOCFG44_PORT_ID_SSI3_FSS                                0x0000003F
#define IOC_IOCFG44_PORT_ID_SSI3_TX                                 0x0000003E
#define IOC_IOCFG44_PORT_ID_SSI3_RX                                 0x0000003D
#define IOC_IOCFG44_PORT_ID_SSI2_CLK                                0x0000003C
#define IOC_IOCFG44_PORT_ID_SSI2_FSS                                0x0000003B
#define IOC_IOCFG44_PORT_ID_SSI2_TX                                 0x0000003A
#define IOC_IOCFG44_PORT_ID_SSI2_RX                                 0x00000039
#define IOC_IOCFG44_PORT_ID_RFC_SMI_CL_IN                           0x00000038
#define IOC_IOCFG44_PORT_ID_RFC_SMI_CL_OUT                          0x00000037
#define IOC_IOCFG44_PORT_ID_RFC_SMI_DL_IN                           0x00000036
#define IOC_IOCFG44_PORT_ID_RFC_SMI_DL_OUT                          0x00000035
#define IOC_IOCFG44_PORT_ID_RFC_GPI1                                0x00000034
#define IOC_IOCFG44_PORT_ID_RFC_GPI0                                0x00000033
#define IOC_IOCFG44_PORT_ID_RFC_GPO3                                0x00000032
#define IOC_IOCFG44_PORT_ID_RFC_GPO2                                0x00000031
#define IOC_IOCFG44_PORT_ID_RFC_GPO1                                0x00000030
#define IOC_IOCFG44_PORT_ID_RFC_GPO0                                0x0000002F
#define IOC_IOCFG44_PORT_ID_RFC_TRC                                 0x0000002E
#define IOC_IOCFG44_PORT_ID_I2S_MCLK                                0x00000029
#define IOC_IOCFG44_PORT_ID_I2S_BCLK                                0x00000028
#define IOC_IOCFG44_PORT_ID_I2S_WCLK                                0x00000027
#define IOC_IOCFG44_PORT_ID_I2S_AD1                                 0x00000026
#define IOC_IOCFG44_PORT_ID_I2S_AD0                                 0x00000025
#define IOC_IOCFG44_PORT_ID_SSI1_CLK                                0x00000024
#define IOC_IOCFG44_PORT_ID_SSI1_FSS                                0x00000023
#define IOC_IOCFG44_PORT_ID_SSI1_TX                                 0x00000022
#define IOC_IOCFG44_PORT_ID_SSI1_RX                                 0x00000021
#define IOC_IOCFG44_PORT_ID_CPU_SWV                                 0x00000020
#define IOC_IOCFG44_PORT_ID_PORT_EVENT7                             0x0000001E
#define IOC_IOCFG44_PORT_ID_PORT_EVENT6                             0x0000001D
#define IOC_IOCFG44_PORT_ID_PORT_EVENT5                             0x0000001C
#define IOC_IOCFG44_PORT_ID_PORT_EVENT4                             0x0000001B
#define IOC_IOCFG44_PORT_ID_PORT_EVENT3                             0x0000001A
#define IOC_IOCFG44_PORT_ID_PORT_EVENT2                             0x00000019
#define IOC_IOCFG44_PORT_ID_PORT_EVENT1                             0x00000018
#define IOC_IOCFG44_PORT_ID_PORT_EVENT0                             0x00000017
#define IOC_IOCFG44_PORT_ID_UART1_RTS                               0x00000016
#define IOC_IOCFG44_PORT_ID_UART1_CTS                               0x00000015
#define IOC_IOCFG44_PORT_ID_UART1_TX                                0x00000014
#define IOC_IOCFG44_PORT_ID_UART1_RX                                0x00000013
#define IOC_IOCFG44_PORT_ID_UART0_RTS                               0x00000012
#define IOC_IOCFG44_PORT_ID_UART0_CTS                               0x00000011
#define IOC_IOCFG44_PORT_ID_UART0_TX                                0x00000010
#define IOC_IOCFG44_PORT_ID_UART0_RX                                0x0000000F
#define IOC_IOCFG44_PORT_ID_I2C0_MSSCL                              0x0000000E
#define IOC_IOCFG44_PORT_ID_I2C0_MSSDA                              0x0000000D
#define IOC_IOCFG44_PORT_ID_SSI0_CLK                                0x0000000C
#define IOC_IOCFG44_PORT_ID_SSI0_FSS                                0x0000000B
#define IOC_IOCFG44_PORT_ID_SSI0_TX                                 0x0000000A
#define IOC_IOCFG44_PORT_ID_SSI0_RX                                 0x00000009
#define IOC_IOCFG44_PORT_ID_AON_CLK32K                              0x00000007
#define IOC_IOCFG44_PORT_ID_GPIO                                    0x00000000

//*****************************************************************************
//
// Register: IOC_O_IOCFG45
//
//*****************************************************************************
// Field:    [31] IOEV_MCU_WU_EN
//
// Event asserted by this IO when edge detection is enabled
//
// 0: Input edge detection does not assert MCU_WU event
// 1: Input edge detection asserts MCU_WU event
#define IOC_IOCFG45_IOEV_MCU_WU_EN                                  0x80000000
#define IOC_IOCFG45_IOEV_MCU_WU_EN_BITN                                     31
#define IOC_IOCFG45_IOEV_MCU_WU_EN_M                                0x80000000
#define IOC_IOCFG45_IOEV_MCU_WU_EN_S                                        31

// Field:    [30] HYST_EN
//
// 0: Input hysteresis disable
// 1: Input hysteresis enable
#define IOC_IOCFG45_HYST_EN                                         0x40000000
#define IOC_IOCFG45_HYST_EN_BITN                                            30
#define IOC_IOCFG45_HYST_EN_M                                       0x40000000
#define IOC_IOCFG45_HYST_EN_S                                               30

// Field:    [29] IE
//
// 0: Input disabled
// 1: Input enabled
//
// Note: If IO is configured for AUX   PORT_ID = 0x08, the enable will be
// ignored.
#define IOC_IOCFG45_IE                                              0x20000000
#define IOC_IOCFG45_IE_BITN                                                 29
#define IOC_IOCFG45_IE_M                                            0x20000000
#define IOC_IOCFG45_IE_S                                                    29

